const array = [-764, 407, 387, 239, -925, -157, 355, 709, 843, 122, -120, -121, -422, -472, -244, -189, -544, 209, 332, 310, 351, -769, -357, 871, 195, 837, -494, 81, -755, 462, -335, 953, 165, 321, -550, -407, 512, -283, -593, 146, 807, 276, -237, 438, 880, 70, 893, -53, 801, -967, -448, 369, -312, 367, 480, -205, 654, -890, 424, -942, -915, -686, -893, -38, -574, 663, -450, -614, 838, 453, 283, -348, 386, -136, 669, 23, 789, 491, 985, -334, -952, -275, 889, 567, 163, -787, 171, 546, -244, -329, 73, 64, 584, 283, -872, 846, -144, 792, 757, -95]

array.sort((a, b) => a - b)


// indexOf бинарным поиском
function indexOf (array, element) {
    let low = 0;
    let high = array.length;

    while (low <= high) {
        let mid = Math.floor((low + high) / 2);
        let midEl = array[mid];
        if (midEl === element) {
            return mid;
        } else if (midEl > element) {
            high = mid - 1;
        } else {
            low = mid + 1;
        }
    }

    return -1
}


console.log( indexOf(array, -764) )